CUsersHYPERPCDocuments1CDemoConversion1/src/DataProcessors/РедактированиеОписанияОбъектовИСвойствФормата/РедактированиеОписанияОбъектовИСвойствФормата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РедактированиеОписанияОбъектовИСвойствФормата</name>
  <attributes>
    <name>ВерсияФормата</name>
    <type>
      <types>CatalogRef.ВерсииФормата</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

CUsersHYPERPCDocuments1CDemoConversion1/src/Catalogs/СвойстваФормата/СвойстваФормата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СвойстваФормата</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ОбъектыФормата</owners>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеТекст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектХранительСвойств</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Обязательное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбщегоСвойства</name>
    <type>
      <types>EnumRef.ТипыОбщихРеквизитов</types>
    </type>
  </attributes>
  <attributes>
    <name>СоставнойТип</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>ТипФормата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

CUsersHYPERPCDocuments1CDemoConversion1/src/DataProcessors/РедактированиеОписанияОбъектовИСвойствФормата/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Подставим версию по умолчанию
	ВыборкаВерсии = Справочники.ВерсииФормата.Выбрать();
	Если ВыборкаВерсии.Следующий() Тогда
		Объект.ВерсияФормата = ВыборкаВерсии.Ссылка;
		ОбновитьДеревоФормата();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не обнаружено ни одной версии формата. Использование данной обработки невозможно.'"),,,,Отказ);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВерсияФорматаПриИзменении(Элемент)
	ОбновитьДеревоФормата();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовТаблицыФормы
&НаКлиенте
Процедура ДеревоФорматаПриАктивизацииСтроки(Элемент)
	СсылкаНаОбъект = Элементы.ДеревоФормата.ТекущиеДанные.СсылкаНаОбъект;
	СтруктураДанныхСсылки = ПрочитатьДанныеСсылкиНаСервере(СсылкаНаОбъект);
	Описание = СтруктураДанныхСсылки.Описание;
	ПорядокСвойства = СтруктураДанныхСсылки.ПорядокСвойства;
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СохранитьДанныеСтроки(Команда)
	СсылкаНаОбъект = Элементы.ДеревоФормата.ТекущиеДанные.СсылкаНаОбъект;
	СохранитьДанныеСтрокиНаСервере(СсылкаНаОбъект);
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОбновитьДеревоФормата()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Объекты.Ссылка КАК Объект,
	|	Свойства.Родитель КАК Родитель,
	|	Свойства.Ссылка КАК Свойство
	|ИЗ Справочник.ОбъектыФормата КАК Объекты
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СвойстваФормата КАК Свойства
	|ПО Объекты.Ссылка = Свойства.Владелец
	|ГДЕ НЕ Объекты.ПометкаУдаления И НЕ Свойства.ПометкаУдаления
	|	И Объекты.Владелец = &ВерсияФормата
	|ИТОГИ ПО Объекты.Ссылка, Свойства.Ссылка ИЕРАРХИЯ";
	Запрос.УстановитьПараметр("ВерсияФормата", Объект.ВерсияФормата);
	ВыборкаОбъекты = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Уровень0 = ДеревоФормата.ПолучитьЭлементы();
	Уровень0.Очистить();
	
	Пока ВыборкаОбъекты.Следующий() Цикл
		ЭлементУровня0 = Уровень0.Добавить();
		ЭлементУровня0.СсылкаНаОбъект = ВыборкаОбъекты.Объект;
		ВыборкаСвойства = ВыборкаОбъекты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		ЭлементГруппа = Неопределено;
		Пока ВыборкаСвойства.Следующий() Цикл
			Если ВыборкаСвойства.Свойство.ЭтоГруппа ИЛИ НЕ ЗначениеЗаполнено(ВыборкаСвойства.Свойство.Родитель) Тогда
				ТекУровень = ЭлементУровня0.ПолучитьЭлементы();
				ЭлементТекУровня = ТекУровень.Добавить();
				ЭлементТекУровня.СсылкаНаОбъект = ВыборкаСвойства.Свойство;
				Если ВыборкаСвойства.Свойство.ЭтоГруппа Тогда
					ЭлементГруппа = ЭлементТекУровня;
				КонецЕсли;
			Иначе
				ТекУровень = ЭлементГруппа.ПолучитьЭлементы();
				ЭлементТекУровня = ТекУровень.Добавить();
				ЭлементТекУровня.Родитель = ЭлементГруппа;
				ЭлементТекУровня.СсылкаНаОбъект = ВыборкаСвойства.Свойство;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрочитатьДанныеСсылкиНаСервере(СсылкаНаОбъект)
	СтруктураВозврат = Новый Структура("Описание, ПорядокСвойства",,0);
	СтруктураВозврат.Описание = СсылкаНаОбъект.Описание.Получить();
	Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.СвойстваФормата") Тогда
		СтруктураВозврат.ПорядокСвойства = СсылкаНаОбъект.Порядок;
	КонецЕсли;
	Возврат СтруктураВозврат;
КонецФункции

&НаСервере
Процедура СохранитьДанныеСтрокиНаСервере(СсылкаНаОбъект)
	СпрОбъект = СсылкаНаОбъект.ПолучитьОбъект();
	СпрОбъект.Описание = Новый ХранилищеЗначения(Описание);
	Если ТипЗнч(СсылкаНаОбъект) = Тип("СправочникСсылка.СвойстваФормата") Тогда
		СпрОбъект.Порядок = ПорядокСвойства;
	КонецЕсли;
	СпрОбъект.Записать();
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти
